import Image from "next/image";
import styles from "./ContentComment.module.scss"


export default function ContentComment() {
  return (
    <div className={styles.contentCommentContainer}>
      <div className={styles.comment}>
        <q>
          Ես անչափ ուրախ եմ մեր համագործակցության արդյունքներով։ Ձեր թիմը իսկապես հասկանում է, թե
          ինչ ենք փնտրում, և արդյունքները գերազանցեցին մեր բոլոր սպասումները։ Չէի կարող ավելի գոհ
          լինել։ Շնորհակալություն ձեր ողջ աշխատանքին և նվիրումին։
        </q>
        <p>— Տաթև , Երջանիկ Հաճախորդ</p>
      </div>
      <div className={styles.info}>
        <h3>Հավատալով</h3>
        <h2>Համակենտրոնանալով Ամենակարևորի Մասին</h2>
        <span className={styles.line}></span>
        <p>
          Մենք նախագծում ենք կահույքի կտորներ, որոնք լիովին համապատասխանում են ձեր յուրահատուկ ոճին
          և տարածքի պահանջներին։ Անկախ նրանից, թե ինչ չափսի, ձևի կամ ոճի կահույք եք փնտրում, մեր
          թիմը կաշխատի ձեզ հետ՝ ստեղծելու կատարյալ դիզայն ձեր տան կամ գրասենյակի համար։
        </p>
        <p>
          Նոր գաղափարներից մինչև պատրաստում՝ մենք վերահսկում ենք ողջ արտադրական գործընթացը։ Մենք
          օգտագործում ենք միայն բարձրորակ նյութեր և պրոֆեսիոնալ վարպետություն՝ համոզվելով, որ ձեր
          կահույքը կլինի ամուր, գործնական և գեղեցիկ՝ երկար տարիներ։
        </p>
        <p>
          Մեր մասնագետները կօգնեն ձեզ պլանավորելու և ձևավորելու ձեր տարածքը՝ համոզվելով, որ ձեր
          կահույքի ընտրությունը ոչ միայն հարմար է ձեր կարիքներին, այլև բարձրացնում է ինչպես
          գործառնական, այնպես էլ ոճային կողմերը։ Անկախ նրանից, թե դուք ձևավորում եք փոքր սենյակ կամ
          մեծ գրասենյակ, մենք կօգնենք ստեղծել ներդաշնակ և արդյունավետ միջավայր։
        </p>
      </div>
      <div
        className={styles.dancer}
      >
        <Image src="/textures/dancer.jpg" alt="Dancer" fill  />
      </div>
    </div>
  );
}
