/* eslint-disable @next/next/no-img-element */
import styles from "./Content.module.scss";

export default function Content() {
  return (
    <div className={styles.contentContainer}>
      <div className={styles.contentInner}>
        <div className={styles.info}>
          <h3>Մեր Վարպետությունը, Ձեր Պատմությունը</h3>
          <h2>Ի՞նչու Ընտրել Մեր Ծառայությունները</h2>
          <span className={styles.line}></span>
          <p>
            HSH Furnitures-ում մենք հավատում ենք, որ կահույքը պարզապես կտորներ չեն՝ այն միավորում է
            գործնականությունը, ոճը և տանը եղած յուրաքանչյուր հատվածի էներգիան։ Սիրով ու
            վարպետությամբ, ինչպես նաև մանրամասներին տրված մեծ ուշադրությամբ, մենք նախագծում և
            ստեղծում ենք կահույք, որը լիովին արտացոլում է ձեր անհատական ոճը և պահանջները։ Բոլոր
            իրերը՝ սկսած գաղափարից և ավարտելով ստեղծման գործընթացը, պատրաստվում են բարձրորակ
            նյութերից, կիրառելով մասնագիտական տեխնիկաներ ու նորարարական դիզայններ։ Մենք համոզված
            ենք, որ յուրաքանչյուր կտոր պետք է լինի ոչ միայն գեղեցիկ, այլև գործնական՝ հեշտ
            օգտագործման և երկարատև: Ուսումնասիրեք մեր աշխատանքների արվեստը և նվիրումը, որը դրված է
            յուրաքանչյուր ստեղծած իրում, և թույլ տվեք մեզ օգնել փոխակերպել ձեր տարածքը՝ դարձնելով
            այն ճիշտ այնպիսիք, ինչպես երազել եք։
          </p>
        </div>
        <div className={styles.infoCells}>
          <div>
            <img src="/icons/pen-ruler-solid.svg" alt="Հատուկ Վարպետություն icon" />
            <h4>Հատուկ Վարպետություն</h4>
            <p>
              Մենք ստեղծում ենք կահույք՝ ի լրումն ձեր տարածքի, ոճի և պահանջների։ Համագործակցում ենք
              ձեզ հետ՝ կյանքի կոչելու ձեր գաղափարը՝ յուրաքանչյուր մանրամասն հարմարեցված։
            </p>
          </div>
          <div>
            <img src="/icons/leaf-solid.svg" alt="Բարձրորակ Նյութեր icon" />
            <h4>Բարձրորակ Նյութեր</h4>
            <p>
              Մենք օգտագործում ենք միայն լավագույն նյութերը՝ ընտրված իրենց կայունության,
              գեղեցկության և էկոլոգիական հարգանքի համար։ Սա երաշխավորում է, որ մեր կահույքը ոչ միայն
              գեղեցիկ է, այլև մնում է ամուր ու տևական տարիներ շարունակ։
            </p>
          </div>
          <div>
            <img src="/icons/hammer-solid.svg" alt="Մասնագիտական Վարպետություն icon" />
            <h4>Մասնագիտական Վարպետություն</h4>
            <p>
              Մեր վարպետների և դիզայներների թիմը բերում է տարիների փորձ և խոր իմացություն
              յուրաքանչյուր նախագծում։ Մենք ուշադրություն ենք դարձնում ամեն մի մանրուքին՝
              ապահովելով, որ յուրաքանչյուր կահույք ստեղծվի բարձր ճշգրտությամբ ու հոգատարությամբ՝
              համապատասխանելով մեր կողմից սահմանված բարձր չափանիշներին։
            </p>
          </div>
          <div>
            <img src="/icons/heart-solid.svg" alt="Հաճախորդների կարիքներին համապատասխան icon" />
            <h4>Հաճախորդների կարիքներին համապատասխան մոտեցում</h4>
            <p>
              Մենք առաջնային նշանակություն ենք տալիս ձեր բավարարմանը՝ սկսած առաջին
              խորհրդատվությունից և նախագծման փուլից մինչև առաքում և հետևողական աջակցություն։ Մեր
              նպատակն է ապահովել անխափան և հաճելի փորձ՝ գերազանցելով ձեր բոլոր սպասումները։
            </p>
          </div>
        </div>
      </div>
    </div>
  );
}
