/* eslint-disable @next/next/no-img-element */
import { useEffect, useRef } from "react";
import styles from "./Content.module.scss";

const features = [
  {
    icon: "pen-ruler-solid.svg",
    title: "Հատուկ Վարպետություն",
    text: "Մենք ստեղծում ենք կահույք՝ ի լրումն ձեր տարածքի, ոճի և պահանջների։ Համագործակցում ենք ձեզ հետ՝ կյանքի կոչելու ձեր գաղափարը՝ յուրաքանչյուր մանրամասն հարմարեցված։",
  },
  {
    icon: "leaf-solid.svg",
    title: "Բարձրորակ Նյութեր",
    text: "Մենք օգտագործում ենք միայն լավագույն նյութերը՝ ընտրված իրենց կայունության, գեղեցկության և էկոլոգիական հարգանքի համար։ Սա երաշխավորում է, որ մեր կահույքը ոչ միայն գեղեցիկ է, այլև մնում է ամուր ու տևական տարիներ շարունակ։",
  },
  {
    icon: "hammer-solid.svg",
    title: "Մասնագիտական Վարպետություն",
    text: "Մեր վարպետների և դիզայներների թիմը բերում է տարիների փորձ և խոր իմացություն յուրաքանչյուր նախագծում։ Մենք ուշադրություն ենք դարձնում ամեն մի մանրուքին՝ ապահովելով, որ յուրաքանչյուր կահույք ստեղծվի բարձր ճշգրտությամբ ու հոգատարությամբ՝ համապատասխանելով մեր կողմից սահմանված բարձր չափանիշներին։",
  },
  {
    icon: "heart-solid.svg",
    title: "Հաճախորդների կարիքներին համապատասխան մոտեցում",
    text: "Մենք առաջնային նշանակություն ենք տալիս ձեր բավարարմանը՝ սկսած առաջին խորհրդատվությունից և նախագծման փուլից մինչև առաքում և հետևողական աջակցություն։ Մեր նպատակն է ապահովել անխափան և հաճելի փորձ՝ գերազանցելով ձեր բոլոր սպասումները։",
  },
];
export default function Content() {
  const wrapperRef = useRef<HTMLDivElement>(null);

  useEffect(() => {
    const el = wrapperRef.current;

    const observer = new IntersectionObserver(
      ([entry]) => {
        if (entry.isIntersecting) {
          el?.classList.add(styles.animate);
          observer.unobserve(entry.target);
        }
      },
      { threshold: 0.3 }
    );

    if (el) observer.observe(el);

    return () => {
      if (el) observer.unobserve(el);
    };
  }, []);

  return (
    <div className={styles.contentContainer}>
      <div ref={wrapperRef} className={styles.contentInner}>
        <div className={styles.info}>
          <h3>Մեր Վարպետությունը, Ձեր Պատմությունը</h3>
          <h2>Ի՞նչու Ընտրել Մեր Ծառայությունները</h2>
          <span className={styles.line}></span>
          <p>
            HSH Furnitures-ում մենք հավատում ենք, որ կահույքը պարզապես կտորներ չեն՝ այն միավորում է
            գործնականությունը, ոճը և տանը եղած յուրաքանչյուր հատվածի էներգիան։ Սիրով ու
            վարպետությամբ, ինչպես նաև մանրամասներին տրված մեծ ուշադրությամբ, մենք նախագծում և
            ստեղծում ենք կահույք, որը լիովին արտացոլում է ձեր անհատական ոճը և պահանջները։ Բոլոր
            իրերը՝ սկսած գաղափարից և ավարտելով ստեղծման գործընթացը, պատրաստվում են բարձրորակ
            նյութերից, կիրառելով մասնագիտական տեխնիկաներ ու նորարարական դիզայններ։ Մենք համոզված
            ենք, որ յուրաքանչյուր կտոր պետք է լինի ոչ միայն գեղեցիկ, այլև գործնական՝ հեշտ
            օգտագործման և երկարատև: Ուսումնասիրեք մեր աշխատանքների արվեստը և նվիրումը, որը դրված է
            յուրաքանչյուր ստեղծած իրում, և թույլ տվեք մեզ օգնել փոխակերպել ձեր տարածքը՝ դարձնելով
            այն ճիշտ այնպիսիք, ինչպես երազել եք։
          </p>
        </div>
        <div className={styles.infoCells}>
          {features.map((item) => (
            <div key={item.title}>
              <img src={`/icons/${item.icon}`} alt={`${item.title} icon`} />
              <h4>{item.title}</h4>
              <p>{item.text}</p>
            </div>
          ))}
        </div>
      </div>
    </div>
  );
}
